app/controllers/posts_controller.rb

  def new
    if params[:author_id] && !Author.exists?
---
SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"